Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc2_mpcbb4.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32U5Gx_gtzc2_mpcbb4 equates.
 */

#pragma once

#include    <stdint.h>

// GTZC2_MPCBB4 address definitions
// --------------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0[3];
    volatile    uint32_t    CFGLOCK;
    volatile    uint32_t    RESERVED1[59];
    volatile    uint32_t    SECCFGR0;
    volatile    uint32_t    RESERVED2[63];
    volatile    uint32_t    PRIVCFGR0;
} GTZC2_MPCBB4_TypeDef;

#ifdef __cplusplus
#define GTZC2_MPCBB4_NS reinterpret_cast<GTZC2_MPCBB4_TypeDef *>(0x46023800U)
#define GTZC2_MPCBB4_S  reinterpret_cast<GTZC2_MPCBB4_TypeDef *>(0x56023800U)

#else
#define GTZC2_MPCBB4_NS ((GTZC2_MPCBB4_TypeDef *)0x46023800U)
#define GTZC2_MPCBB4_S  ((GTZC2_MPCBB4_TypeDef *)0x56023800U)
#endif

// CR Configuration

#define GTZC2_MPCBB4_CR_SRWILADIS       (0x1U<<31)
#define GTZC2_MPCBB4_CR_INVSECSTATE     (0x1U<<30)
#define GTZC2_MPCBB4_CR_GLOCK           (0x1U<<0)

// CFGLOCK Configuration

#define GTZC2_MPCBB4_CFGLOCK_SPLCK0     (0x1U<<0)

// SECCFGR0 Configuration

#define GTZC2_MPCBB4_SECCFGR0_SEC31     (0x1U<<31)
#define GTZC2_MPCBB4_SECCFGR0_SEC30     (0x1U<<30)
#define GTZC2_MPCBB4_SECCFGR0_SEC29     (0x1U<<29)
#define GTZC2_MPCBB4_SECCFGR0_SEC28     (0x1U<<28)
#define GTZC2_MPCBB4_SECCFGR0_SEC27     (0x1U<<27)
#define GTZC2_MPCBB4_SECCFGR0_SEC26     (0x1U<<26)
#define GTZC2_MPCBB4_SECCFGR0_SEC25     (0x1U<<25)
#define GTZC2_MPCBB4_SECCFGR0_SEC24     (0x1U<<24)
#define GTZC2_MPCBB4_SECCFGR0_SEC23     (0x1U<<23)
#define GTZC2_MPCBB4_SECCFGR0_SEC22     (0x1U<<22)
#define GTZC2_MPCBB4_SECCFGR0_SEC21     (0x1U<<21)
#define GTZC2_MPCBB4_SECCFGR0_SEC20     (0x1U<<20)
#define GTZC2_MPCBB4_SECCFGR0_SEC19     (0x1U<<19)
#define GTZC2_MPCBB4_SECCFGR0_SEC18     (0x1U<<18)
#define GTZC2_MPCBB4_SECCFGR0_SEC17     (0x1U<<17)
#define GTZC2_MPCBB4_SECCFGR0_SEC16     (0x1U<<16)
#define GTZC2_MPCBB4_SECCFGR0_SEC15     (0x1U<<15)
#define GTZC2_MPCBB4_SECCFGR0_SEC14     (0x1U<<14)
#define GTZC2_MPCBB4_SECCFGR0_SEC13     (0x1U<<13)
#define GTZC2_MPCBB4_SECCFGR0_SEC12     (0x1U<<12)
#define GTZC2_MPCBB4_SECCFGR0_SEC11     (0x1U<<11)
#define GTZC2_MPCBB4_SECCFGR0_SEC10     (0x1U<<10)
#define GTZC2_MPCBB4_SECCFGR0_SEC9      (0x1U<<9)
#define GTZC2_MPCBB4_SECCFGR0_SEC8      (0x1U<<8)
#define GTZC2_MPCBB4_SECCFGR0_SEC7      (0x1U<<7)
#define GTZC2_MPCBB4_SECCFGR0_SEC6      (0x1U<<6)
#define GTZC2_MPCBB4_SECCFGR0_SEC5      (0x1U<<5)
#define GTZC2_MPCBB4_SECCFGR0_SEC4      (0x1U<<4)
#define GTZC2_MPCBB4_SECCFGR0_SEC3      (0x1U<<3)
#define GTZC2_MPCBB4_SECCFGR0_SEC2      (0x1U<<2)
#define GTZC2_MPCBB4_SECCFGR0_SEC1      (0x1U<<1)
#define GTZC2_MPCBB4_SECCFGR0_SEC0      (0x1U<<0)

// PRIVCFGR0 Configuration

#define GTZC2_MPCBB4_PRIVCFGR0_PRIV31   (0x1U<<31)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV30   (0x1U<<30)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV29   (0x1U<<29)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV28   (0x1U<<28)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV27   (0x1U<<27)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV26   (0x1U<<26)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV25   (0x1U<<25)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV24   (0x1U<<24)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV23   (0x1U<<23)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV22   (0x1U<<22)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV21   (0x1U<<21)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV20   (0x1U<<20)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV19   (0x1U<<19)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV18   (0x1U<<18)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV17   (0x1U<<17)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV16   (0x1U<<16)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV15   (0x1U<<15)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV14   (0x1U<<14)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV13   (0x1U<<13)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV12   (0x1U<<12)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV11   (0x1U<<11)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV10   (0x1U<<10)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV9    (0x1U<<9)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV8    (0x1U<<8)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV7    (0x1U<<7)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV6    (0x1U<<6)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV5    (0x1U<<5)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV4    (0x1U<<4)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV3    (0x1U<<3)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV2    (0x1U<<2)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV1    (0x1U<<1)
#define GTZC2_MPCBB4_PRIVCFGR0_PRIV0    (0x1U<<0)
